embarquech/cryptnox-sdk-esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# ── Flash Encryption and Secure Boot V2 ─────────────────────────────────────
# These settings involve one-time eFuse programming and are specific to each
# production deployment.  They must be configured in the application project
# (e.g. the POS project), not in this SDK.
#
# Add the following to your application's sdkconfig.defaults and follow the
# provisioning guide for your platform before flashing production hardware:
#
#   CONFIG_SECURE_FLASH_ENC_ENABLED=y
#   CONFIG_SECURE_FLASH_ENCRYPTION_MODE_RELEASE=y
#   CONFIG_SECURE_BOOT=y
#   CONFIG_SECURE_BOOT_V2_ENABLED=y
#   CONFIG_SECURE_BOOT_BUILD_SIGNED_BINARIES=y
